#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "07f834cb6227fe085b553930003bb5de" -> "633ad5e5125b774d26cc5e1c7b5f11be"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "aa75907c18e421b4ceccba3de1d6c7ae" -> "857b9a28506489e727fca68c1a0cec30"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "bdc7713041da0068c12978d436d66803" -> "964887c31784b3910c88475c489eee79"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "453e4384c736fa1797d4438e122bbf71" -> "d24f7f9e7fbdd6b4927f271ac9035a29"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "2d7bcd3117c5a158f2a8b5b902d7a7ff" -> "8f4d13eacff9e57327bc103b7c2c5796"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "a9b24088629c5aa5a588e451965ed616" -> "93450d5ff2570c302126cc92d6b5a80e"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "e959a9c9461fcefec688df50db184ae9" -> "5bbd70238d84e005f18eaacd79848dfd"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "bbc72e87c03b5d8fa5c1f7b98f81d8c6" -> "6dc1abe28839f1700350e96a790ce299"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "a19cd238838913055f074a41b949e872" -> "ed562bfd2570655649b22f2e3af03a17"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "601ff53a29a4e23d68d01161340436ac" -> "3b0713499cad5cde8fdfa0acbe03706c"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "8d259c495fe20b773fd78167aae6cb8d" -> "ed225d761c0d41bd3a29a4f89d6333a6"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "7c7a5708cd1f541f77db2e6e2fc527cb" -> "fa5526483562fcad93d4595050e8b77d"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "d1a17e0fab4c38041a8f468d97251217" -> "661c2cc044c7f0377e259f26ca0d2e78"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "09f0d2410641ad2d3fbf33ef3417c8b3" -> "df216d375601916b14a3190e34d3e0c6"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "f3f6c5665297d31021033353f1f955bb" -> "6dce06b84d778b5f377446ae962ec461"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "e9652ab12003c7f37ce5b9ce079bfb7b" -> "1bb5a7f40202b060bf7de21986118d65"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "e61137c0a52c4c8bf97273e6b68618dd" -> "77ef724f6f5c245af12ebe3c508e527e"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "bfe60566e68821c87ec1124c3b60ac15" -> "62a886d3c3485109110bb8a740602a02"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "83d7e39948a32745c3e00acfa81f0775" -> "dba7942b9af15a5623ef16c37a441273"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "e4131bd38321bcc8dae9b4b2d9ae606e" -> "47f6f20fce1cb4cb72f54b517c07fdf7"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "c1c2b6d8fb2fe63a419fb344fb14543d" -> "43581ccc8d54ce7f9464da0c1a74480b"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "9e7953263f48b90be8c58ee4a39c66f8" -> "a3d0db7ac8bbcd3e246709af6c7172ce"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "2f8c370c7f6c89ad51dbbc9bede93fdc" -> "73da9230207bd10c913c86bd02710744"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "7d9f0191effde14274151ee9a62a55b7" -> "5a9990209876c4bfa867202503a98430"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "8c7e59b21f5137167371e416dd60d597" -> "afc980d03392c189527d1f2c848b174b"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "cd0034257356293578248885a6547dcf" -> "eee96efdf96a8acdbb0791a98d7a58c9"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "8d5bd82bb8566de2dda53e4b84b423dd" -> "ccdd3e9aa445f0d66233cfb39c556fc5"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag               = "15bf5b42b757fbfdd79dd7e3a6aa1f20" -> "a184a7f930a88a74d91f1d640f85852f"
        id                 = "lambdas/demo/get_full_year_total_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "99b177d1995b2054bb58617041baed0f" -> "320095e938ff2e0cc1ea44fc9d1d0041"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "02db5f86ea9e7a678eeebe5985c1b259" -> "5ad275124ab81d948439ff57031fd8fd"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "b7093c5e3a021ef9e61f7a0db6d2fcae" -> "d2b97c6891a51f697d5283a7f7243180"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "c151674dbcbc1a085261b37fe21088ab" -> "0ec5a0938491530da3320264972315c0"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "f07b32129180eeef032d2b636c69946d" -> "89c5fea6b0b1d70ae264407b78b7c9e1"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "6ddef67d1582f24ac0d020bc9e72449f" -> "c42d400a29d59c3582670d1dedf43a0a"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "cfad19a9cf91b2abfc82eeb317eee8b6" -> "f6c1b30175e903a701d714fc88031003"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "adcfc5e29eb180df64d8210b6fcfdbc6" -> "2936ebcb85b22b14ff9f898cae99ff2d"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "22ee05ebfc08eaee8eeb2175b39642c7" -> "27ba9a05288dc647b5a98f69f1d1192c"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "bb85a9370091b0bbfb6175ff268d645e" -> "3401d3b46a49ce7c4790e31993b09575"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "5b02798322bddf80bb154e29612e1c7f" -> "e99419c018f1b02d5e18bfce73744aac"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "ef43aac585b580c5ee4e070f21af1075" -> "d14259e3e683969ca00da94d552bd552"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "d651b0c4cc267bef137b713a943f1d8e" -> "7b4d2bb931ac9f0faa89e02b16b0b570"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "65a1007208faa96bf93d944edf2bfd8c" -> "ce7f3b8bdbeb245dcf5aa57d039699e9"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "71e532075095176ed11332ee8e48a5d1" -> "f896d8c0c7f5d9805160cc5814b5419c"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "8237ed4cbdcea80791bc7a8e089695d2" -> "17a6f0b8bbf2e831f57ebc2096f960be"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "c5d79fb3a93aa39fa3e47425eb0b5eeb" -> "82b7b101b61c01eb8fcbf05f6b5ed1a1"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "3f7df2c9ee5178e4fec54698e058e708" -> "1643d6367c0b93b1fc7c7e4bf24ecdd6"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "MS755qiXjgLVP+X+yFaB6a6xhoLmcUDtI/UksKzmeSg=" -> "x5hmizXSS9LrfslIHG7dWuEjVOEGdDGjnyA/gMksD/E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "t5PB/tKfdAJPBOiaHJm2VIYXg2IzGFdfRukyTVsFcSw=" -> "Kffe8MeF+1ffHooUpfJfjXKPffk94YYKtDq9AbDodXQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "EP1oOpdzjoaLVYylnauLPCuOVrInJRIg8S74ctePKwA=" -> "NpRdqerY4FrNZuRKGgue5SxGl4/2+9cM6GkiEG9aHL8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "kVgtuNDjZB00+7LZihhItd15GCOq3HDhtt42Owngscw=" -> "N5OMKdjIWGZY8h+cRHR6eiWDw3QzBVeEHCkj8bMkrIc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "4+jMLJEK5h+0ZUdCWirqhVXZzNvdObpXQHZgn69gejM=" -> "+I/YKiZSio02hBj/7sD3XeCVFpLTWAootkciM/9p4BM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "q37c5Wmgq84RePz6v9QkhEVuNOg4NndYVQLOTQsPD1o=" -> "qf0WHqI7vaFLTvCzRDeQLuhhLIPgblqhr6NXjQ8ZFsc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "uufMUu2rMzYQGZrYWf/GcZ7G2CXnPDSybSVnIUzWLEg=" -> "TMr9XrA5N27wV67U/VYCyrcL2scCq5xYN9BotwT1Ixg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "BzTlkL5pvC4B8zXVE32MGz2VD2SdznqZjhhcoKnInNo=" -> "NchUKc860ivojU4acJGhGnnLqWp4bIDfUI+WtJBWSRc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "IgpBSWXxx2bgVRmUWMd8VPvq9AACWnxQQGBBxvYl+iY=" -> "/3woDqXOKkC8Shi6JJPkVgZpaxybRfF0Q1MQFlpLZBo="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "JsMhorwkj2ryJ3WvNhmO1Xwc4n2onciSdNKmVED8cxg=" -> "Kbyzi/78CxszYyE7TzbMElDJY5hU9LzFi2tEQFYqVgM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "NTgs+EyV/uC7GAH+q5N6iXEjaOl7VsLmVCjie7TIZts=" -> "r53zxNO477yrI6ke/lsw3P8Bw1Ra2IOSfwB1cqSMkBk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "FuEnSMwco8rGsBlmHZEKCBWYDtGopyQIdiy6j/0foQI=" -> "3k1HEfc2Ymsi6SyR5kk2UL5PGcGpQKqAY9cR2QkD5xA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "ttHHWOjEmrp31tuMIbhutFvmN4CS11e2hegvfoMRpLM=" -> "FLMdiXvMQLabv/B9Q2R+nww1chUy3GOoUQZnLf+NGVk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "JMZLwZlG1PaQPeG4/HRaT4o1W4wGjNqL/of2+xyxgR4=" -> "pTk4N1MzvMURFjabIShcqpOKg/W4XE08p9+4mBxlPuk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "+uaM3gisk85HGF3LIIjsl0tmLxIQSdvcU0yj8/G2RBE=" -> "KGZeGq7rS+bacQymKBNNfuAf4ZtBvGdBO0ENYAkdEMk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "JQ4HpohmMzVKwIikH2oBswNW/c3W3d42GuSDfXgflfU=" -> "zIqSB5WIF9xrJ6pcel/A06hvB9nTqIaqnH6Srbxhs2c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "qbxcaFqfw4wkF/nOtxN6GdS3mUmI8u+5u4obaEY+0Dg=" -> "yCB9c74cCGELb2Dhl+j+ZZd5p2yTEhcZhlH0atU8FTA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "AKGaLAeQWRKB7AFl3ksz/3unRswGmvTBwPWR3ZLaoso=" -> "M1i4lPggXV4tuRirSIhrqcs7ETbE+r9luw1xaZhOdww="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "PoJcnVG+YKYdI0f0gEM2+YXIqwxC1fBBJuEhze1cGu8=" -> "cutYgNIkcP1PTrMEaJ5vC3MH9+c4xuWFOo3d5nwBNzo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZXutaqjc+alJuTTMJ4mZ/R92/OTj7Wmq+Au9+t1dHPo=" -> "GXCMzFJLAxDvD4rJCLaARA2sLwv2pWJQweEYp/2P2bw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "beL+wnKZ2YNJzkhbRdt3vvDTGMQNxASZNtZGrLvaV4s=" -> "ckxbwIjRBSvv1AkbmWJktMzGHGCJv8n2zDAF5JJWaKM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "+Oep8s+rgAVQIUjbaAugw6vAhtAXw4aTnZlxxm6CvS8=" -> "iBIQjUiAPGFhuCaXXSXRl6aj11KsNiZtgqwCS8A73j0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ec4PTpaTCimyooPR9JGzvjNed6ADmS/aHJxS6lnA0L8=" -> "4lSVYwjSy/CddCf4hU9uKJLAxZGy/XmKP4E1EzOQYOk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "zKnmt3zAr5FtIkeekRvvlbd+zO4+2+UiVvFRrWOuXgw=" -> "0wYnFTTGFbe4hgfr5y3Pa/MbkXS5O7/USYSWffrP2Nk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "ascV00k7JSj/eSSURQvDhxaX2heRLYoO15Kzup+ag/E=" -> "T+oEK+qzlys1iDnlAsSaaV8r6Zw3Oj/tcP0wYuGye8U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "EfhGUT3tx76l9IJKs/abdDRcPA7ZoNxuYRn7DWKsOSk=" -> "HHj+swdr15Z3b/GOXQ3UZZmxpqAkC60A9puECjiafqk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-24T23:15:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "n7SkX2qBLCy9GScvEcJv7j8Xj04TwkYKhb9A1QtyXnk=" -> "ARxvX2RrO0a7dtpvn4z9MssacDhUcmuuasSlChal314="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "2TqYioqTAyZd9ByLRnYCtGPxtz3cCOiVTUz4K9QprSM=" -> "S4S7vFM4AONt9oDCf6vXnlBXfKX32XLvHvcQ/vSPu9Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "YvDN/QIqMRvslk1rzT14LivaplYSwARGwCxpaHkZsXk=" -> "6G0LEw2+JjNFF9L6UE8PwtrAWw9pqIDFb8wM0gm5WQA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "UkKU6G8Iu7SCSEeADvQGTt6DFwRFdClCJ01Hv3R9u4U=" -> "9W2hbf3ztCu9uRJia9HdgsO47WMNIFtofqiTDxxcFk8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "6OkfGbruwr2rRZNx4EDL7in1U9yLbhwO0uANc9yHgVc=" -> "GU0cT4rQn+z5ZS4n35f6+bu9kX8Cdu1fVKQ/2lr9kpM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "Hx0mDGJQ8KbYBGGXh+sQggr+ReFQbScbkSVyY2Ux8Fg=" -> "04QUP4RLJqrlvYsU5F2kaap4n1UsVBwx2+WOwpzEuLU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "16A2pw8nlFTZMRLJmAaX+WwMPMA1m5dWz8O8pS/qp4w=" -> "PYoLsWpkPPuM0Jq0CkS3QnXcW7KxyPPy8qjZIVUy7Ek="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "rNDDl0R1+sp5ZMVYyJyguWE9klc0E/5Qqj1YQ5o78oM=" -> "bK0mGtz9bzW8M33s9Cpn77sKcaZZUOmZ0d6E/6m9Isw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "tpgbDZeyoeDYVdL1ThTTXBSnRmWot7tMnJEL33edENA=" -> "jJTQSXKK1soJFi+renUfZJ/EFS13frm6GDt7tjPpEMA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "rkNrxroIb5+pGcT/5abm2Zz5zByodb5483DnrG62kTM=" -> "88p10TbP21DoWek/FPFUSUdAiK0LCI5PIuWUslSVo78="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "k0N7bTzCsWIFRXUEHAi10mmM2OGGi3KuL48YMwHHUAY=" -> "ADuapHR3EMY8Y0WDTqCrqLqe7CI4gzbd5DliccmY95Q="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "lrD03TZ5x+IRsQcP/qO7UX88DflVWTCL6QyciOg1ywk=" -> "DyxCBdlHeUB0SZv6LknjHdqZEPLaoXsKA/nV/FrQVL4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "pOtYEOP7d/6pXABh8Xkzd5nBlNk/bTD8eM+Cf2ZnJYo=" -> "FpVLibXnfj/TG27CFnXp/selEWYPeQ0uL5rx9POnxB4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "LzMBXltqcyzSOSK6aaUGlcZmCwhZt0ZEKV9futc3Iy8=" -> "9NLHjN81QeTHhTxGEyztJshszcUlS8SR3UODqBGXes8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "oBYY3VO5AIx9u3oeHyX8prTXubkDk3qzb4Xa7iF65zI=" -> "wx8RqlKvc3tk3a8k64BDrshmuL0XQwA11kd80TiJsPo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "9rNSPL3EkWYHmivfnK6J2q6H7BTNlns3mRGIUTRyE+E=" -> "zEu+S2zlzYgh88a4O6AzXq2lIJAIMn4gD5+UCdroyMI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "xPTtZ/MMAyh8Wt0k4XVAvond94ke04WfNQazPOPu10I=" -> "71hgtnNf/uWX/glO602sI6gYhF8CX6R6cIkk14z9fUY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "YlSya3dSMroenMmJmokC1/bsZ51e6fR/ZJbnCJvkN9A=" -> "aJZyIDjlS+J/1v1rKClILAxCxquoZOnLGFzbVSJLVGE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "Tcl/oaKuGRC8nEcSY+InRV+ZP2OBn6RB2wGeO7c91xg=" -> "Ohtn8/bYf4Y6S+1SxC06gnycTlgYR15PrL71p3ANd7Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-01-12T21:12:02Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "dk0err" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-01-12T21:12:01Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-01-12T21:12:00Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 93 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*